In [3]:
import numpy as np
import pandas as pd
from io import StringIO

In [48]:
df=pd.DataFrame(np.random.rand(5,6),index=["a","b","c","d","e"],columns=["col1","col2","col3","col4","col5","col6"])

In [49]:
df.head()

       col1      col2      col3      col4      col5      col6
a  0.146414  0.254635  0.038519  0.022567  0.171244  0.233217
b  0.743896  0.106612  0.841417  0.134216  0.788160  0.309569
c  0.527088  0.722814  0.653498  0.584656  0.368395  0.066993
d  0.941695  0.779480  0.905119  0.298732  0.213548  0.988150
e  0.283883  0.104844  0.474542  0.186237  0.648164  0.521658

In [50]:
df.describe()

           col1      col2      col3      col4      col5      col6
count  5.000000  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.528595  0.393677  0.582619  0.245282  0.437902  0.423917
std    0.325175  0.332543  0.347754  0.214159  0.270723  0.355228
min    0.146414  0.104844  0.038519  0.022567  0.171244  0.066993
25%    0.283883  0.106612  0.474542  0.134216  0.213548  0.233217
50%    0.527088  0.254635  0.653498  0.186237  0.368395  0.309569
75%    0.743896  0.722814  0.841417  0.298732  0.648164  0.521658
max    0.941695  0.779480  0.905119  0.584656  0.788160  0.988150

In [51]:
data=('col1,col2,col3\n''x,y,z\n''c,d,3'
     )

In [52]:
type(data)

str

In [66]:
df=pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [68]:
df.to_csv('tutorial6.csv')

In [74]:
data2=('a,b,c\n' '1,2,3\n' '1,2,3\n' '1,2,3\n')

In [100]:
df2=pd.read_csv(StringIO(data2),dtype=object)
df2
df2.dtypes

a    object
b    object
c    object
dtype: object

In [122]:
# make any column as index column df2=pd.read_csv(StringIO(data2),index_col=1)

In [130]:
df2=pd.read_csv(StringIO(data2))
df2

   a  b  c
0  1  2  3
1  1  2  3
2  1  2  3

In [134]:
df2=pd.read_csv(StringIO(data2),index_col=1)
df2

   a  c
b
2  1  3
2  1  3
2  1  3

In [150]:
data3='a,b\n "hello,\\"bob\\",nice to see you",5'
df3=pd.read_csv(StringIO(data3),escapechar='\\',dtype=object)
df3

                             a  b
"hello "bob"  nice to see you"  5

In [174]:
df3=pd.read_csv("industry.csv",dtype=object)
df3.head(4)

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing

In [198]:
csv_data = """Name,Age,\\Department,\\Salary
John Doe,28,Engineering,\\50000
Jane Smith,34,Marketing,\t60000
Sam Wilson,41,Human Resources,\t45000
Lisa Brown,25,Engineering,52000
Michael Johnson ,38,Sales,58000
"""

In [206]:
df4=pd.read_csv(StringIO(csv_data),escapechar='\\')
df4

               Name  Age       Department  Salary
0          John Doe   28      Engineering   50000
1        Jane Smith   34        Marketing   60000
2        Sam Wilson   41  Human Resources   45000
3        Lisa Brown   25      Engineering   52000
4  Michael Johnson    38            Sales   58000

In [1]:
data = """Name\tAge\tOccupation
John\t28\tEngineer
Anna\t25\tDoctor
Mike\t30\tArtist
// Comment line
Sara\t22\tDesigner
"""

In [29]:
s=pd.read_csv(StringIO(data),sep="\t")
s.head(2)

   Name   Age Occupation
0  John  28.0   Engineer
1  Anna  25.0     Doctor

In [37]:
s.to_csv("t6practice.csv")